In [1]:
import pandas as pd

In [3]:
people = {
    'first': ['Haha', 'Jane', 'John'], 
    'last': ['lol', 'Doe', 'Doe'], 
    'email': ['hahalol@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

  first last              email
0  Haha  lol  hahalol@gmail.com
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [6]:
df['first']+' '+df['last']

0    Haha lol
1    Jane Doe
2    John Doe
dtype: object

In [7]:
df['Full_Name']=df['first']+' '+df['last']

In [8]:
df

  first last              email Full_Name
0  Haha  lol  hahalol@gmail.com  Haha lol
1  Jane  Doe  JaneDoe@email.com  Jane Doe
2  John  Doe  JohnDoe@email.com  John Doe

In [10]:
df.drop(columns=['first','last'], inplace=True)

In [11]:
df

               email Full_Name
0  hahalol@gmail.com  Haha lol
1  JaneDoe@email.com  Jane Doe
2  JohnDoe@email.com  John Doe

In [15]:
df['Full_Name'].str.split(' ', expand=True)

      0    1
0  Haha  lol
1  Jane  Doe
2  John  Doe

In [16]:
df[['first','last']] = df['Full_Name'].str.split(' ', expand=True)

In [17]:
df

               email Full_Name first last
0  hahalol@gmail.com  Haha lol  Haha  lol
1  JaneDoe@email.com  Jane Doe  Jane  Doe
2  JohnDoe@email.com  John Doe  John  Doe

In [18]:
df.append({'first':'Tony'}, ignore_index=True)

C:\Users\SHAHEEN\AppData\Local\Temp\ipykernel_15820\3354624249.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'}, ignore_index=True)

               email Full_Name first last
0  hahalol@gmail.com  Haha lol  Haha  lol
1  JaneDoe@email.com  Jane Doe  Jane  Doe
2  JohnDoe@email.com  John Doe  John  Doe
3                NaN       NaN  Tony  NaN

In [31]:
people = {
    'first': ['Eren', 'Mikasa'], 
    'last': ['Jeager', 'Akerman'], 
    'email': ['free@outside.wall', 'mikasa@akerman.com']
}
df2 = pd.DataFrame(people)

In [32]:
df = df.append(df2, ignore_index=True)

C:\Users\SHAHEEN\AppData\Local\Temp\ipykernel_15820\445450659.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True)

In [35]:
df

                email Full_Name   first     last
0   hahalol@gmail.com  Haha lol    Haha      lol
1   JaneDoe@email.com  Jane Doe    Jane      Doe
2   JohnDoe@email.com  John Doe    John      Doe
3   free@outside.wall       NaN    Eren   Jeager
5  mikasa@akerman.com       NaN  Mikasa  Akerman

In [36]:
df.drop(index=5, axis=0, inplace=True)

In [37]:
df

               email Full_Name first    last
0  hahalol@gmail.com  Haha lol  Haha     lol
1  JaneDoe@email.com  Jane Doe  Jane     Doe
2  JohnDoe@email.com  John Doe  John     Doe
3  free@outside.wall       NaN  Eren  Jeager

In [38]:
df.drop(index=df[df['last']=='Doe'].index)

               email Full_Name first    last
0  hahalol@gmail.com  Haha lol  Haha     lol
3  free@outside.wall       NaN  Eren  Jeager